wildfly-10.1.0/bin/SoapMessage.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:reg="http://www.registrocivil.gob.ec" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><wss:Security xmlns:wss="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wss:UsernameToken><wss:Username>0912252590</wss:Username><wss:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">RyBquCElPcgSSSbXmbahZ1j/pSg=</wss:Password><wss:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">nqww47Dj5qrvSGPILb2fRg==</wss:Nonce><wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2018-10-04T17:37:31Z</wsu:Created></wss:UsernameToken><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Created>2018-10-04T17:37:31Z</wsu:Created><wsu:Expires>2018-10-04T17:41:31Z</wsu:Expires></wsu:Timestamp></wss:Security></SOAP-ENV:Header><SOAP-ENV:Body><reg:BusquedaPorNui><CodigoInstitucion>3</CodigoInstitucion><CodigoAgencia>100</CodigoAgencia><Usuario>iepi1</Usuario><Contrasenia>Pm8MzC%Z</Contrasenia><NUI>1101067849</NUI></reg:BusquedaPorNui></SOAP-ENV:Body></SOAP-ENV:Envelope>